#include <stdio.h>

int main() {
    char* movies[10] = {
        "1917", "Врятувати рядового Раяна", "Суцільнометалева оболонка", "Апокаліпсис сьогодні", 
        "Брати по зброї", "Дюнкерк", "Комірка для поранених", "Чорний яструб", "Падіння Чорного яструба", 
        "Тонка червона лінія", "Лють"
    };

    int years[10] = {2019, 1998, 1987, 1979, 2001, 2017, 2008, 2001, 1998, 2014};

    int choice;

    printf("Введіть номер військового фільму (1-10): ");
    scanf("%d", &choice);

    if (choice >= 1 && choice <= 10) {
        printf("Фільм/Серіал: %s, Рік виробництва: %d\n", movies[choice - 1], years[choice - 1]);
    } else {
        printf("Невірний номер! Будь ласка, введіть число від 1 до 10.\n");
    }

    return 0;
}
